/**
 * @mainpage
 * # Загальне завдання
 * 1. Дано масив з  цілих чисел. **Знайти** безперервну послідовність позитивних чисел у вхідному масиві, сума елементів якої максимальна, та переписати їх у вихідний масив.
 * @author Yaylo D.
 * @date 29-nov-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Yaylo D.
 * @date 29-nov-2020
 * @version 1.0
 */

#include "stdio.h"
#include "stdarg.h"

int task(int N, ...);

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - вивід результату роботи функції @function task
 * @return успішний код повернення з програми (0)
 */
int main() {
	task(10, 1, -1, 1, 1, 1, 1, -1, 1, 1, 1);
	
}

/**
 * @function task
 *
 * Послідовність дій:
 * - оголошеня змінних 
 *	 @param mas Масив вказівників на числа, 
 * 	        які передаються за допомогою варівтивної функції
 *	 @param masr Масив масивів вказівників з строками,
 *	 	які утворюють безперервні послідовності позитивних чисел.
 * - Заповнення масиву mas за допомогою варівтивної функції
 * - Перевірка на виконання умови
 * - Виписування всих ділянок, які утворюють безперервні послідовності 
 *   позитивних чисел.
 * - Знаходження найбільшої, за сумою всих елементів, ділянки
 * - Вивід на екран результату виконання операцій
 */
int task(int N, ...){
	va_list args;/**Початок роботи з варіативними аргументами */
	va_start(args, N);
	
	int *mas = (int*)calloc(N, sizeof(int));
	for (int i =0; i<N; i++){
		int value = va_arg(args, int);
		*(mas+i)=value;
	}
	
	int **masr= (int **)calloc(N, sizeof(int *));
	for(int i=0;i<N;i++){
		masr[i] = (int*)calloc(N, sizeof(int));
	}
	
	int j =0,max=0,k=0;
	
	for(int i=0;i<N; i++){
		if(*(mas+i)>0){
			*(*(masr+j))+=*(mas+i);    /*Первый символ является суммой строки положительных чисел*/
			*(*(masr+j)+k+1)=*(mas+i); /*Строка положительных чисел*/
			k++;
		} else if(*(mas+i)<0){
			if(*(*(masr+j))!=0){
				j++;
				k=0;
			}
		}
	}
	for(int i=0;i<N;i++){
		for(int j=0;j<N;j++){
			printf("%d ", *(*(masr+i)+j));
		}
		printf("\n");
	}
	/*Нахождение максимальной строки массива*/
	for(int i=1;*(*(masr+i))!=0;i++){
		if(*(*(masr+i))>*(*(masr+i-1))){
			if(*(*(masr+i))>*(*(masr+max))){
				max=i;
			}
		}
	}	
	/*Вывод максимальной строки массива*/
	printf("\n");
	for(int i=0;*(*(masr+max)+i)!=0;i++){
		printf("%d ", *(*(masr+max)+i));
	}
	/*Освобождение памяти*/
	free(mas);
	for(int i=0; i<N; i++){
		free(masr[i]);
	}
	free(masr);
	
	va_end(args);
}
